NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32ZG23/EFR32ZG23A020F512GM40.svd
        <register>
          <name>SQ</name>
          <description>No Description</description>
          <addressOffset>0x230</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0003</resetMask>
          <fields>
            <field>
              <name>SQEN</name>
              <description>SQ enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SQSWRST</name>
              <description>SQ hold demod</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SQTIMOUT</name>
              <description>SQ Timeout</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SQEXT</name>
          <description>No Description</description>
          <addressOffset>0x234</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SQSTG2TIMOUT</name>
              <description>SQ Timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SQSTG3TIMOUT</name>
              <description>SQ Timeout</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI</name>
          <description>No Description</description>
          <addressOffset>0x238</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF0001</resetMask>
          <fields>
            <field>
              <name>SQISELECT</name>
              <description>SQI selection bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CORR</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHIPERROR</name>
              <description>Chip errors</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTDIVCTRL</name>
          <description>No Description</description>
          <addressOffset>0x23C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>ADPRETHRESH</name>
              <description>Preamble threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENADPRETHRESH</name>
              <description>Enable Preamble threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable use of Preamble threshold after timing detection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable use of Preamble threshold after timing detection</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANTDIVDISCCA</name>
              <description>Antenna switch disable for CSMA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANTDIVSELCCA</name>
              <description>Antenna switch selection for CSMA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTDIVFW</name>
          <description>No Description</description>
          <addressOffset>0x240</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000003</resetMask>
          <fields>
            <field>
              <name>FWSELANT</name>
              <description>FW antenna selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FWANTSWCMD</name>
              <description>FW Antenna SW cmd</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FWANTDIVEN</name>
              <description>Enable FW ANT-DIV mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHDMODANTDIV</name>
          <description>No Description</description>
          <addressOffset>0x244</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x40FF1FFF</resetMask>
          <fields>
            <field>
              <name>ANTWAIT</name>
              <description>ANTENNA WAIT TIME</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIPRSSITHD</name>
              <description>RSSI THD to SKIP 2th  ANTENNA Evaluate</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIPCORRTHD</name>
              <description>CORR THD to SKIP 2th  ANTENNA Evaluate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SKIP2ANT</name>
              <description>SKIP 2th  ANTENNA Evaluate</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHANTDECSION</name>
          <description>No Description</description>
          <addressOffset>0x248</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF007FFFF</resetMask>
          <fields>
            <field>
              <name>CORRANDDIVTHD</name>
              <description>Correlation Selection in region</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSIANDDIVTHD</name>
              <description>RSSI Selection in region</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSICORR0</name>
              <description>RSSI-CORR  Selection in Region0 </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSICORR1</name>
              <description>RSSI-CORR  Selection in Region1 </description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSICORR2</name>
              <description>RSSI-CORR  Selection in Region2 </description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSICORR3</name>
              <description>RSSI-CORR  Selection in Region3 </description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHDMODCTRL</name>
          <description>No Description</description>
          <addressOffset>0x24C</addressOffset>
          <access>read-write</access>
          <resetValue>0x01DF0004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMDETTHD</name>
              <description>Preamble Detection Thrshould</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMTIMLOSTHD</name>
              <description>Preamble Timing loss thrshold</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMTIMLOSEN</name>
              <description>Preamble timing loss detection </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSIFLTBYP</name>
              <description>Bypass RSSI Filering</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMDETEN</name>
              <description>PREAMBLE DET</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REMODOSR</name>
              <description>REMOD INPUT OSR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REMODDWN</name>
              <description>REMOD downsampling ratio</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REMODOUTSEL</name>
              <description>REMOD OUTPUT Selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REMODEN</name>
              <description>REMOD ENABLE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCRDETECTOR</name>
              <description>Enbale BCRDMOD Dtetector ONLY</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCRTRECSCONC</name>
              <description>BCR/LEGACY CONCURRENT MODE</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCRLEGACYCONC</name>
              <description>BCR/TRECS CONCURRENT MODE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCAL</name>
          <description>No Description</description>
          <addressOffset>0x270</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFBF</resetMask>
          <fields>
            <field>
              <name>IRCALEN</name>
              <description>IRCAL enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MURSHF</name>
              <description>MUR shift value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUISHF</name>
              <description>MUI shift value</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRCORREN</name>
              <description>IR Correction enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRCALCOEFRSTCMD</name>
              <description>IRCAL coef reset cmd</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IRCALIFADCDBG</name>
              <description>IRCAL IFADC DBG</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCALCOEF</name>
          <description>No Description</description>
          <addressOffset>0x274</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <fields>
            <field>
              <name>CRV</name>
              <description>CRV coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CIV</name>
              <description>CIV coefficient</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCALCOEFWR0</name>
          <description>No Description</description>
          <addressOffset>0x278</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRVWD</name>
              <description>CRV coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWD</name>
              <description>CIV coefficient</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCALCOEFWR1</name>
          <description>No Description</description>
          <addressOffset>0x27C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRVWD</name>
              <description>CRV coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWD</name>
              <description>CIV coefficient</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRL1</name>
          <description>No Description</description>
          <addressOffset>0x280</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCTRL1</name>
              <description>AD control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRL2</name>
          <description>No Description</description>
          <addressOffset>0x284</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCTRL2</name>
              <description>AD control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADQUAL0</name>
          <description>No Description</description>
          <addressOffset>0x288</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF03FF</resetMask>
          <fields>
            <field>
              <name>ADRSSI0</name>
              <description>ANT0 RSSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADRSSI1</name>
              <description>ANT1 RSSI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADQUAL1</name>
          <description>No Description</description>
          <addressOffset>0x28C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCORR0</name>
              <description>ANT0 CORR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADSTAT1</name>
              <description>ADSTAT1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADQUAL2</name>
          <description>No Description</description>
          <addressOffset>0x290</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF03FF</resetMask>
          <fields>
            <field>
              <name>ADRSSI0P</name>
              <description>Previous ANT0 RSSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADRSSI1P</name>
              <description>Previous ANT1 RSSI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADQUAL3</name>
          <description>No Description</description>
          <addressOffset>0x294</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCORR0P</name>
              <description>Previous ANT0 CORR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADSTAT2</name>
              <description>ADSTAT2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
